#+title: Push, Pop, Done!
#+author: Greg Pfeil <greg@technomadic.org>

PPD is a simple stack-based task manager.

As you start new tasks that interrupt your current task, you “push” them onto the stack. As you complete tasks, you “pop” them off the stack. Tasks can also be abandoned or deferred/resumed.

* bindings

To use this global minor mode, you most likely want to assign a prefix key to access the commands, like

~(global-set-key (kbd "C-c p") 'ppd-mode-map)~

After that, you can type the prefix key followed by the keys below to interact with PPD.

#+name: bindings
#+begin_src emacs-lisp
(substitute-command-keys "\\{ppd-mode-map}")
#+end_src

#+RESULTS: bindings
#+begin_example
key             binding
---             -------

a               ppd-abandon-current-task
c               ppd-clear-stacks
d               ppd-defer-current-task
f               ppd-finish-current-task
h               ppd-helm
n               ppd-start-new-task
r               ppd-resume-deferred-task

#+end_example

